Camelingual/OCRWebServiceRecognize-request-template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <OCRWebServiceRecognize xmlns="http://stockservice.contoso.com/wse/samples/2005/10">
            <user_name>${user_name}</user_name>
            <license_code>${license_code}</license_code>
            <OCRWSInputImage>
                <fileName>${imagefilename}</fileName>
                <fileData>${imagedata}</fileData>
            </OCRWSInputImage>
            <OCRWSSetting>
                <ocrLanguages>${language}</ocrLanguages>
                <outputDocumentFormat>TXT</outputDocumentFormat>
                <convertToBW>false</convertToBW>
                <getOCRText>true</getOCRText>
                <createOutputDocument>false</createOutputDocument>
                <multiPageDoc>false</multiPageDoc>
                <ocrWords>false</ocrWords>
            </OCRWSSetting>
        </OCRWebServiceRecognize>
    </soap:Body>
</soap:Envelope>
